{
    "$language$" : "de",
    "$meta-keywords$" : "Forschung, Till Knollmann, Paderborn, Universität Paderborn, Docker, Kubernetes, Machine Learning, Informatik, Python, Rust, Algorithmen",
    "$meta-description$": "Dr. Till Knollmann ist Backend-Softwareentwickler mit einem Hintergrund in der theoretischen Informatik.",
    "$title$" : "Till Knollmanns Persönliche Webseite",
    "$profile-header$" : "Dr. Till Knollmann",
    "$description$" : "Theoretischer Informatiker und<br>Entwickler aus Begeisterung",
    "$lang-button$" : "English",
    "$lang-button-target$" : "../en/",
    "$research-button-target$" : "https://www.researchgate.net/profile/Till-Knollmann-2",
    "$impr-button$" : "Impressum",
    "$about-title$" : "Über mich",
    "$about-text$" : "<p>Mein Name ist Till Knollmann. Ich bin sowohl beruflich als auch privat leidenschaftlicher Softwareentwickler mit einem Hintergrund in der theoretischen Informatik.</p> <p>Nach meinem Bachelor- und Masterstudium der Informatik an der Universität Paderborn, promovierte ich in der Fachgruppe Algorithmen und Komplexität am Heinz Nixdorf Institut. Meine Forschungsschwerpunkte waren Online-Algorithmen, die heterogene Ressourcen verwalten, und Anfragen für diese kosteneffizient beantworten. Außerdem arbeitete ich an verteilte Datenstrukturen, Flow-Problemen und theoretischen Robotermodellen. Meine Haupttätigkeiten lagen in der mathematischen Modellierung von Problemen sowie der Entwicklung und Analyse von Algorithmen.</p> <p>Seit Juli 2023 arbeite ich als Softwareentwickler bei der WPS Management GmbH. Als Teil eines agilen Teams liegt mein Fokus auf der Backend-Entwicklung einer auf Spring Boot basierenden Microservice-Architektur.</p> <p> Auch in meiner Freizeit beschäftige ich mich gerne mit Themen wie Programmierung in Java, C#, Python und Rust, Werkzeugen wie Docker, Kubernetes und Cloudlösungen, oder Ansätzen wie maschinellem Lernen. Außerdem nehme ich seit zwei Jahren begeistert am Advent of Code teil und veröffentliche meine Lösungen auf GitHub.</p> <p>Sowohl die theoretische als auch die praktische Seite der Informatik faszinieren mich und machen mir Spaß. Geht es Ihnen ähnlich? Dann vernetzen Sie sich gerne mit mir bei LinkedIn oder GitHub, oder kontaktieren Sie mich per E-Mail.</p>",
    "$pub-title$" : "Meine Publikationen",
    "$pub-text$" : "Während meiner Zeit als Doktorand veröffentlichte ich die folgenden Ergebnisse:",
    "$pub-title-main$" : "Hauptveröffentlichungen (7)",
    "$pub-title-other$" : "Weitere Veröffentlichungen (13)",
    "$contact-title$" : "Kontakt",
    "$contact-text$" : "Falls Sie mit mir in Kontakt treten möchten, nutzen Sie gerne das untere Formular oder vernetzen Sie sich mit mir über LinkedIn. Ich freue mich auf Ihre Nachricht.",
    "$contact-name-placeholder$" : "Name",
    "$contact-email-placeholder$" : "E-Mail",
    "$contact-message-placeholder$" : "Nachricht",
    "$contact-submit$" : "Senden"
}