{
    "$language$" : "de",
    "$title$" : "Till Knollmanns Webseite",
    "$profile-header$" : "Till Knollmann",
    "$description$" : "Doktorand in der<br>theoretischen Informatik und<br>Entwickler aus Begeisterung",
    "$lang-button$" : "English",
    "$lang-button-target$" : "../en/index.html",
    "$work-button-target$" : "https://www.hni.uni-paderborn.de/alg/mitarbeiter/tillk/",
    "$impr-button$" : "Impressum",
    "$about-title$" : "Über mich",
    "$about-text$" : "<p>Mein Name ist Till Knollmann. Ich bin Doktorand in der theoretischen Informatik an der Universität Paderborn und dem Heinz-Nixdorf Institut.</p><p>Nach meinem Bachelor- und Masterstudium der Informatik in Paderborn, begann ich meine Promotion in der Fachgruppe Algorithmen und Komplexität. Mein Schwerpunkt sind Online-Algorithmen, die heterogene Ressourcen verwalten, und über die Zeit erscheinende Anfragen kosteneffizient beantworten. Zusätzlich interessieren mich verteilte Datenstrukturen, Flow-Probleme und theoretische Robotermodelle. Meine Haupttätigkeiten liegen in der mathematischen Modellierung von Problemen sowie der Entwicklung und Analyse von Algorithmen.</p> <p>Ich bin immer daran interessiert, neue Technologien zu entdecken, und habe so in meiner Freizeit Erfahrungen in verschiedenen Programmiersprachen wie Java, C#, Python und Rust sowie in Tools wie Docker und Kubernetes sammeln. Darüber hinaus habe ich mich mit maschinellem Lernen in Python beschäftigt. Um meine Fähigkeiten im Programmieren zu testen und zu vertiefen habe in den letzten beiden Jahren den jährlichen Advent of Code vollständig gelöst und meinen Code auf Github veröffentlicht.</p> <p>Ich bringe eine starke akademische Ausbildung, fundierte Kenntnisse in verschiedenen Programmiersprachen und ein tiefes Verständnis für theoretische Informatik mit. Ich bin bestrebt, meine Fähigkeiten in einem herausfordernden und wachsenden Arbeitsumfeld einzusetzen und ständig neue Fähigkeiten zu erlernen und zu verbessern. Treten Sie gerne mit mir in Kontakt über LinkedIn, Github oder per E-Mail.</p>",
    "$pub-title$" : "Meine Publikationen",
    "$pub-text$" : "Während meiner Zeit als Doktorand lernte ich viele spannende Themen kennen und veröffentlichte die folgenden Ergebnisse.",
    "$contact-title$" : "Kontakt",
    "$contact-text$" : "Falls Sie mit mir in Kontakte treten möchten, nutzen Sie gerne das untere Formular oder vernetzen Sie sich mit mir über LinkedIn. Ich freue mich auf Ihre Nachricht.",
    "$contact-name-placeholder$" : "Name",
    "$contact-email-placeholder$" : "E-Mail",
    "$contact-message-placeholder$" : "Nachricht",
    "$contact-submit$" : "Senden"
}