{
    "$language$" : "en",
    "$meta-keywords$" : "Research, Till Knollmann, Paderborn, Paderborn University, Docker, Kubernetes, Machine Learning, Computer Science, Python, Rust, Algorithms",
    "$meta-description$": "Dr. Till Knollmann is a backend software developer with a background in theoretical computer science.",
    "$title$" : "Till Knollmann's Personal Website",
    "$profile-header$" : "Dr. Till Knollmann",
    "$description$" : "Theoretical computer scientist<br>and developer out of passion",
    "$lang-button$" : "Deutsch",
    "$lang-button-target$" : "../de/",
    "$research-button-target$" : "https://www.researchgate.net/profile/Till-Knollmann-2",
    "$impr-button$" : "Imprint",
    "$about-title$" : "About Me",
    "$about-text$" : "<p>My name is Till Knollmann. I am both professionally and privately passionate about software development with a background in theoretical computer science.</p> <p>After completing my bachelor's and master's degree in computer science at the Paderborn University, I earned my doctoral degree in the Algorithms and Complexity research group at the Heinz Nixdorf Institut. My research focus was on online algorithms that manage heterogeneous resources and cost-effectively answer requests for them. I also worked on distributed data structures, flow problems, and theoretical robot models. My main activities involved the mathematical modeling of problems as well as the development and analysis of algorithms.</p> <p>Since July 2023, I work as a software developer at WPS Management GmbH. As part of an agile team, my focus is on the backend development of a microservice architecture based on Spring Boot.</p> <p>Also in my spare time I like to engage technological topics like development in Java, C#, Python and Rust, tools like Docker, Kubernetes and cloud solutions, or approaches like machine learning. Additionally, I have been eagerly competing in the Advent of Code for the past two years and published my solutions on GitHub.</p> <p>Both the theoretical and practical sides of computer science fascinate me and delight me. Do you feel the same way? Then feel free to connect with me on LinkedIn or GitHub, or contact me by email.</p>",
    "$projects-title$" : "Public Projects",
    "$projects-text$" : "Here are some of my public projects that I have worked on:",
    "$projects$" : [
        {
            "title": "Advent of Code Solutions",
            "description": "My solutions to the Advent of Code challenges from various years, implemented in Rust and Python. These showcase problem-solving approaches and algorithm implementations.",
            "url": "https://github.com/TillKnollmann?tab=repositories&q=AdventOfCode",
            "button_text": "View on GitHub"
        },
        {
            "title": "Personal Homepage",
            "description": "This website itself is an open-source project! Built with a custom localization system, Bootstrap, and deployed via GitHub Actions.",
            "url": "https://github.com/TillKnollmann/Homepage",
            "button_text": "View on GitHub"
        }
    ],
    "$pub-title$" : "My Publications",
    "$pub-text$" : "During my doctoral studies, I published the following results:",
    "$pub-title-main$" : "Main Publications (7)",
    "$pub-title-other$" : "Other Publications (14)",
    "$contact-title$" : "Contact Me",
    "$contact-text$" : "If you would like to get in touch with me, feel free to use the form below or connect with me via LinkedIn. I am looking forward to your message.",
    "$contact-name-placeholder$" : "Name",
    "$contact-email-placeholder$" : "Email",
    "$contact-message-placeholder$" : "Message",
    "$contact-submit$" : "Submit"
}