{
    "$language$" : "en",
    "$title$" : "Till Knollmann's Website",
    "$profile-header$" : "Till Knollmann",
    "$description$" : "Researcher in theoretical<br>computer science and<br>developer out of passion",
    "$lang-button$" : "Deutsch",
    "$lang-button-target$" : "../de/index.html",
    "$impr-button$" : "Imprint",
    "$about-title$" : "About Me",
    "$about-text$" : "<p>My name is Till Knollmann. I am a doctoral candidate in theoretical computer science at the University of Paderborn and the Heinz-Nixdorf Institute.</p> <p>After completing my bachelor's and master's degree in computer science at Paderborn, I started my doctoral studies in the Algorithms and Complexity research group. My research focus is on online algorithms that manage heterogeneous resources and cost-effectively answer requests that appear over time. I am also interested in distributed data structures, flow problems, and theoretical robot models. My main activities involve the mathematical modeling of problems as well as the development and analysis of algorithms.</p> <p>I am always interested in discovering new technologies and have gained experience in various programming languages such as Java, C#, Python, and Rust, as well as in tools such as Docker and Kubernetes in my spare time. Additionally, I have worked with machine learning in Python. In the past two years, I have completed the annual Advent of Code challenge and published my code on Github to test and deepen my programming skills.</p> <p>I bring a strong academic background, comprehensive knowledge of various programming languages, and a deep understanding of theoretical computer science. I am committed to utilizing my skills in a challenging and growing work environment and constantly learning and improving new skills. Please feel free to contact me via LinkedIn, Github, or email.</p>",
    "$pub-title$" : "My Publications",
    "$pub-text$" : "During my doctoral studies, I encountered many interesting problems and published the following results.",
    "$contact-title$" : "Contact Me",
    "$contact-text$" : "If you would like to get in touch with me, feel free to use the form below or connect with me via LinkedIn. I am looking forward to your message.",
    "$contact-name-placeholder$" : "Name",
    "$contact-email-placeholder$" : "Email",
    "$contact-message-placeholder$" : "Message",
    "$contact-submit$" : "Submit"
}